Curtain grid lines must have at least one segment.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AllGridSegmentsRemoved { get; }
  Visual Basic
Public Shared ReadOnly Property AllGridSegmentsRemoved As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AllGridSegmentsRemoved {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace